#!python3
#coding=utf-8

# 计算税后收入

wages = float(input("请输入您的税前工资："))
iit = 0
if (wages > 3500):
    if (3500 < wages <= 4500):
        iit = (wages - 3500) * 0.03
    elif (4500 < wages <= 8000):
        iit = (wages - 4500) * 0.1 + 1500 * 0.03
    elif (8000 < wages <= 12500):
        iit = (wages - 8000) * 0.2 + 3000 * 0.1 + 1500 * 0.03
    elif (12500 < wages <= 38500):
        iit = (wages - 12500) * 0.25 + 4500 * 0.2 + 3000 * 0.1 + 1500 * 0.03
    elif (38500 < wages <= 58500):
        iit = (wages - 38500) * 0.3 + 26000 * 0.25 + 4500 * 0.2 + 3000 * 0.1 + 1500 * 0.03
    elif (58500 < wages <= 83500):
        iit = (wages - 58500) * 0.35 + 20000 * 0.3 + 26000 * 0.25 + 4500 * 0.2 + 3000 * 0.1 + 1500 * 0.03
    elif (wages > 83500):
        iit = (wages - 83500) * 0.45 + 25000 * 0.35 + 20000 * 0.3 + 26000 * 0.25 + 4500 * 0.2 + 3000 * 0.1 + 1500 * 0.03

reali = wages - iit
print ("需要缴纳个人所得税：", iit, "扣除税后的实际个人收入：" ,reali)